In [1]:
# 1. Two sum
print('ASCII code Z =', ord('z'))
s = 'string'
sum = 0
for i in range(len(s)-1):
    sum +=(abs(ord(s[i])-ord(s[i+1])))

print('row = ', s)
print('sum codes = ', sum)

ASCII code Z = 122
row =  string
sum codes =  24

In [24]:
# 175. Combine Two Tables
import pandas as pd

def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    # Выполняем слияние таблиц на основе столбца 'personId'
    result = person.merge(address, on='personId', how='left')
    
    # Выводим результат
    return result

data_person = {
  "personId": [1, 2, 3],
  "lastName": ['Ivanov', 'Li', 'Ki'],
  "firstName": ['Alex', 'Vano', 'All']
}

df_pers = pd.DataFrame(data_person)
print('Table person')
print(df_pers)

data_address = {
  "personId": [1, 2],
  "addressId": [42, 2],
  "city": ['Moscow', 'Blaburg']
}

df_address = pd.DataFrame(data_address)
print('Table address')
print(df_address)

combine_two_tables(df_pers,df_address)

Table person
   personId lastName firstName
0         1   Ivanov      Alex
1         2       Li      Vano
2         3       Ki       All
Table address
   personId  addressId     city
0         1         42   Moscow
1         2          2  Blaburg

   personId lastName firstName  addressId     city
0         1   Ivanov      Alex       42.0   Moscow
1         2       Li      Vano        2.0  Blaburg
2         3       Ki       All        NaN      NaN